In [2]:
import pandas as pd
import numpy as np

In [3]:
# DataFrames: It is a two-dimensional data structure constructed with rows and columns,
# which is more similar to Excel spreadsheet.

In [4]:
#  Pandas Series is one-dimensional labeled array capable of holding data of any type (integer, string, float, Python objects etc.).
#  The axis labels are collectively called indexes.
ser1=pd.Series
print(ser1)

<class 'pandas.core.series.Series'>

In [11]:
arr1=np.array(['a',1,2])
print(arr1)
ser2=pd.Series(arr1)
print(ser2)

['a' '1' '2']
0    a
1    1
2    2
dtype: object

In [12]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [13]:
#from list
lst=[1,'a',2]
df=pd.DataFrame(lst)
print(df)

   0
0  1
1  a
2  2

In [15]:
#from numpy array
arr1=np.array([[1,1,1],[2,2,2],[3,3,3]])
df=pd.DataFrame(data=arr1,columns=['A','B','C'])
print(df)

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3

In [17]:
#from dictionary of lists

dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}

df = pd.DataFrame(dict)

print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [19]:

data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data,index=[10,11,12,13,14,15,16,17,18,19,20,21,'p'])

print(ser['p'])

s

In [21]:
#add,sub,mul,dic, etc
ser1 = pd.Series([1, 2, 3], index=['A', 'B', 'C'])
ser2 = pd.Series([4, 5, 6], index=['A', 'B', 'C'])

df_sum = ser1.add(ser2)
print(df_sum)

A    5
B    7
C    9
dtype: int64

In [23]:
# transform datatype within series
ser = pd.Series([1, 2, 3, 4])
ser = ser.astype(float)
print(ser)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [24]:
# head(n)- displays top n rows
# tail(n)- displays last n rows

In [25]:
url = "https://media.geeksforgeeks.org/wp-content/uploads/nba.csv"
data = pd.read_csv(url)

In [26]:
data.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [ ]:
data.describe()
# also to get noy numm count, dtype- print(df.info())

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [ ]:
#for categorical variable
data.describe(include=object)

                 Name                  Team Position Height   College
count             457                   457      457    457       373
unique            457                    30        5     18       118
top     Avery Bradley  New Orleans Pelicans       SG    6-9  Kentucky
freq                1                    19      102     59        22

In [41]:
#selecting columns
data[['Name','Team']].head()

            Name            Team
0  Avery Bradley  Boston Celtics
1    Jae Crowder  Boston Celtics
2   John Holland  Boston Celtics
3    R.J. Hunter  Boston Celtics
4  Jonas Jerebko  Boston Celtics

In [52]:
# adding a column
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}# Convert the dictionary into DataFrame
df1 = pd.DataFrame(data1)
Age=['23','2','23','2']
df1['Age']=Age
print(df1)

     Name  Height Qualification Age
0     Jai     5.1           Msc  23
1  Princi     6.2            MA   2
2  Gaurav     5.1           Msc  23
3    Anuj     5.2           Msc   2

In [53]:
#dropping a column
df1.drop(['Age'],axis=1)

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

In [54]:
# .iloc[] for position-based selection and .loc[] for label-based selection
# loc[] includes both start and end labels
# iloc[] excludes last and works only on integer

In [ ]:
url = "https://media.geeksforgeeks.org/wp-content/uploads/nba.csv"
data3 = pd.read_csv(url,index_col='Name')


#df = pd.DataFrame(data, index = ["day1", "day2", "day3"]) - we can give random strings also as index
# to change index - data3.set_index("title")

In [ ]:
# To get a series
data3.loc['Avery Bradley']

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

In [ ]:
# To get a dataframe
data3.loc[['Avery Bradley','Jae Crowder']]

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

In [61]:
data3.iloc[1]

Team        Boston Celtics
Number                99.0
Position                SF
Age                   25.0
Height                 6-6
Weight               235.0
College          Marquette
Salary           6796117.0
Name: Jae Crowder, dtype: object

In [ ]:
#To get column
data3.iloc[:,0]

#To get first 3 row's particular col values
data3.iloc[:3, 0]

#to pass list
# data3.iloc[[0, 1, 2], 0]

Name
Avery Bradley    Boston Celtics
Jae Crowder      Boston Celtics
John Holland     Boston Celtics
Name: Team, dtype: object

In [ ]:
# large DataFrame with many rows, Pandas will only return the first 5 rows, and the last 5
# use to_string() to print the entire DataFrame.
# df = pd.read_csv('data.csv')
# print(df.to_string())

In [ ]:
# to remove rows which have null values -
# df.dropna() - it creates a new df
# df.dropna(inplace = True) - it changes original df
#Remove rows with a NULL value in the "Date" column: df.dropna(subset=['Date'], inplace = True)

# df.fillna({"Calories": 130}, inplace=True) - to fill empty cells with some values

# To replace with mean/median/mode
# x = df["Calories"].mean()
# df.fillna({"Calories": x}, inplace=True)

In [ ]:
# If wrong format of date
# df['Date'] = pd.to_datetime(df['Date'], format='mixed')

In [ ]:
"""

      Duration          Date  Pulse  Maxpulse  Calories
  0         60  '2020/12/01'    110       130     409.1
  1         60  '2020/12/02'    117       145     479.0
  2         60  '2020/12/03'    103       135     340.0
  3         45  '2020/12/04'    109       175     282.4
  4         45  '2020/12/05'    117       148     406.0
  5         60  '2020/12/06'    102       127     300.0
  6         60  '2020/12/07'    110       136     374.0
  7        450  '2020/12/08'    104       134     253.3
  8         30  '2020/12/09'    109       133     195.1
  9         60  '2020/12/10'     98       124     269.0
  10        60  '2020/12/11'    103       147     329.3
  11        60  '2020/12/12'    100       120     250.7
  12        60  '2020/12/12'    100       120     250.7
  13        60  '2020/12/13'    106       128     345.3
  14        60  '2020/12/14'    104       132     379.3
  15        60  '2020/12/15'     98       123     275.0
  16        60  '2020/12/16'     98       120     215.2
  17        60  '2020/12/17'    100       120     300.0
  18        45  '2020/12/18'     90       112       NaN
  19        60  '2020/12/19'    103       123     323.0
  20        45  '2020/12/20'     97       125     243.0
  21        60  '2020/12/21'    108       131     364.2
  22        45           NaN    100       119     282.0
  23        60  '2020/12/23'    130       101     300.0
  24        45  '2020/12/24'    105       132     246.0
  25        60  '2020/12/25'    102       126     334.5
  26        60      20201226    100       120     250.0
  27        60  '2020/12/27'     92       118     241.0
  28        60  '2020/12/28'    103       132       NaN
  29        60  '2020/12/29'    100       132     280.0
  30        60  '2020/12/30'    102       129     380.3
  31        60  '2020/12/31'     92       115     243.0

"""
# in this dataset for people working out 7th row's 450 value is wrong

# for x in df.index:
#     if df.loc[x,'Duration']>120:
#         df.loc[x,'Duration']=120

#or deleting it
# for x in df.index:
#   if df.loc[x, "Duration"] > 120:
#     df.drop(x, inplace = True)

"\n\n      Duration          Date  Pulse  Maxpulse  Calories\n  0         60  '2020/12/01'    110       130     409.1\n  1         60  '2020/12/02'    117       145     479.0\n  2         60  '2020/12/03'    103       135     340.0\n  3         45  '2020/12/04'    109       175     282.4\n  4         45  '2020/12/05'    117       148     406.0\n  5         60  '2020/12/06'    102       127     300.0\n  6         60  '2020/12/07'    110       136     374.0\n  7        450  '2020/12/08'    104       134     253.3\n  8         30  '2020/12/09'    109       133     195.1\n  9         60  '2020/12/10'     98       124     269.0\n  10        60  '2020/12/11'    103       147     329.3\n  11        60  '2020/12/12'    100       120     250.7\n  12        60  '2020/12/12'    100       120     250.7\n  13        60  '2020/12/13'    106       128     345.3\n  14        60  '2020/12/14'    104       132     379.3\n  15        60  '2020/12/15'     98       123     275.0\n  16        60  '2020/12/16'     98       120     215.2\n  17        60  '2020/12/17'    100       120     300.0\n  18        45  '2020/12/18'     90       112       NaN\n  19        60  '2020/12/19'    103       123     323.0\n  20        45  '2020/12/20'     97       125     243.0\n  21        60  '2020/12/21'    108       131     364.2\n  22        45           NaN    100       119     282.0\n  23        60  '2020/12/23'    130       101     300.0\n  24        45  '2020/12/24'    105       132     246.0\n  25        60  '2020/12/25'    102       126     334.5\n  26        60      20201226    100       120     250.0\n  27        60  '2020/12/27'     92       118     241.0\n  28        60  '2020/12/28'    103       132       NaN\n  29        60  '2020/12/29'    100       132     280.0\n  30        60  '2020/12/30'    102       129     380.3\n  31        60  '2020/12/31'     92       115     243.0\n\n"

In [66]:
# Duplicates
# Returns True for every row that is a duplicate, otherwise False:
# print(df.duplicated())
# df.drop_duplicates(inplace = True)

In [ ]:
# df.corr()
# The corr() method calculates the relationship between each column in your data set.
# The corr() method ignores "not numeric" columns.